ben/blog/2025-09-19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Journal for the week of Sep 19th 2025</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Journal for the week of Sep 19th 2025</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/languages.html">languages</a> <a href="tags/spanish.html">spanish</a> <a href="tags/journal.html">journal</a></span></p>

<div id="outline-container-orge3add74" class="outline-2">
<h2 id="orge3add74">Work</h2>
<div class="outline-text-2" id="text-orge3add74">
<p>
I've been focusing on the project I received feedback on and it's been good. I can get caught trying to work on a bunch of small things and not make enough time for the big projects, so this has been a good reminder.
</p>

<p>
I also will avoid work I don't have a good understanding of. Especially if there is a quick win I can get on another project.
</p>
</div>
</div>
<div id="outline-container-orgd521d6e" class="outline-2">
<h2 id="orgd521d6e">Personal</h2>
<div class="outline-text-2" id="text-orgd521d6e">
<p>
Playing indoor soccer 2x/week. I also try to lift weights but haven't had any time for that with work commitments.
</p>

<p>
Currently reading: Hamlet by Shakespeare.  The prose to is hard to understand at times, and the sentence structure isn't different from modern English. It feels closer to the Spanish that I'm learning. Also, it feels like every other page or so, there's a quotable passage! It's really lovely.
</p>

<p>
I'm also reading Ready Player 2, mostly to fall asleep at night and because I'm a huge cyberpunk nerd.
</p>

<p>
I also lead a tech book group that meets once a week (our spouses call it "nerd night"). We're currently reading "Why Machines Learn" about the origins of machine learning and deep learning. The chapters are pretty easy reads (20-40 pages) and I'm using AI to generate discussion questions. Since the chapters are short our meetings end up veering of topic after a while. The group seems to enjoy the conversations, so I don't push too hard on staying focused.
</p>
</div>
</div>
<div id="outline-container-orgbfc4d7b" class="outline-2">
<h2 id="orgbfc4d7b">Coding</h2>
<div class="outline-text-2" id="text-orgbfc4d7b">
<p>
I haven't done any personal coding the last two weeks because all my coding free time is spent on work coding. I expect it to be like this for the next 2-3 weeks until the project is shipped.
</p>
</div>
</div>
<div id="outline-container-org1d3e433" class="outline-2">
<h2 id="org1d3e433">Spanish</h2>
<div class="outline-text-2" id="text-org1d3e433">
<p>
I had a conversation with a native speaker yesterday! It was fairly brief (10 mins or so), but I understood what he was saying and was able to say most of what I wanted to! I've known this person for a few years so I wasn't as nervous talking to him as I am with people I don't know.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-19</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
